[
    {
        "name": "scrcpy",
        "http_url": "https://github.com/Genymobile/scrcpy.git",
        "ssh_url": "git@github.com:Genymobile/scrcpy.git",
        "summary": "**scrcpy** is a lightweight, open-source application designed to mirror and control Android devices from a computer via USB or TCP/IP. It supports high-performance screen mirroring (30-120fps), low latency (35-70ms), and features like audio forwarding, screen recording, virtual displays, and physical keyboard/mouse simulation. It works on Linux, Windows, and macOS without requiring root access or leaving any traces on the Android device. The project emphasizes simplicity, performance, and user freedom, making it a versatile tool for Android device management.",
        "commit_count": 2777,
        "is_opt_keyword": 67,
        "deepseek_true": 8,
        "deepseek_false": 59,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 8,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "Sandboxie",
        "http_url": "https://github.com/sandboxie-plus/Sandboxie.git",
        "ssh_url": "git@github.com:sandboxie-plus/Sandboxie.git",
        "summary": "Sandboxie is a sandbox-based isolation software for Windows, designed to run applications in an isolated environment without permanently modifying the system. It offers two editions: **Sandboxie Plus** with a modern Qt-based UI and advanced features like snapshot management, privacy modes, and network firewalls, and **Sandboxie Classic** with an older MFC-based UI. The project is a community fork of the original Sandboxie, now open-source, and supports features like encrypted sandboxes, process control, and integration with Windows components. It is maintained by a community of contributors and includes tools for enhancing functionality, such as LogApiDll and SbieHide.",
        "commit_count": 6142,
        "is_opt_keyword": 73,
        "deepseek_true": 1,
        "deepseek_false": 72,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "godot",
        "http_url": "https://github.com/godotengine/godot.git",
        "ssh_url": "git@github.com:godotengine/godot.git",
        "summary": "The **Godot Engine** repository is a comprehensive, open-source game engine designed for creating both 2D and 3D games across multiple platforms, including desktop, mobile, web, and consoles. It offers a unified interface with a rich set of tools, enabling developers to focus on game creation without reinventing the wheel. The engine is free under the MIT license, community-driven, and supported by the Godot Foundation, with extensive documentation, demos, and community resources available for users and contributors.",
        "commit_count": 70491,
        "is_opt_keyword": 3621,
        "deepseek_true": 405,
        "deepseek_false": 3216,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 405,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "rufus",
        "http_url": "https://github.com/pbatard/rufus.git",
        "ssh_url": "git@github.com:pbatard/rufus.git",
        "summary": "Rufus is a reliable and portable utility designed for formatting and creating bootable USB drives. It supports a wide range of file systems (FAT, NTFS, exFAT, etc.), can create bootable drives from ISOs or disk images, and includes features like checksum computation, bad block checks, and Windows installation enhancements. Built with Visual Studio 2022 or MinGW, Rufus is open-source (GPL v3), supports 38 languages, and is compatible with Secure Boot, making it a versatile tool for both individual and professional use.",
        "commit_count": 2216,
        "is_opt_keyword": 244,
        "deepseek_true": 14,
        "deepseek_false": 230,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 14,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "folly",
        "http_url": "https://github.com/facebook/folly.git",
        "ssh_url": "git@github.com:facebook/folly.git",
        "summary": "**folly** is Facebook's open-source C++ library designed for practicality and efficiency, primarily used internally at Facebook and as a dependency for other Facebook C++ projects. It complements standard libraries like `std` and Boost, focusing on high performance at scale, and includes a variety of core components such as data structures, concurrency utilities, and memory management tools. The library is built using C++17 and supports multiple platforms (Linux, macOS, Windows) and compilers (GCC, Clang, MSVC). It is typically built as a static library and includes a `getdeps.py` script to manage dependencies and build processes.",
        "commit_count": 13717,
        "is_opt_keyword": 566,
        "deepseek_true": 278,
        "deepseek_false": 288,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 278,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "rocksdb",
        "http_url": "https://github.com/facebook/rocksdb.git",
        "ssh_url": "git@github.com:facebook/rocksdb.git",
        "summary": "RocksDB is a high-performance persistent key-value store library developed by Facebook, optimized for flash and RAM storage. It is based on LevelDB and features a Log-Structured-Merge (LSM) design, offering flexible trade-offs between write, read, and space amplification. Key functionalities include multi-threaded compactions, making it suitable for handling large-scale data (multiple terabytes) efficiently. The library is dual-licensed under GPLv2 and Apache 2.0, and it is widely used as a core building block for fast key-value servers.",
        "commit_count": 4970,
        "is_opt_keyword": 1073,
        "deepseek_true": 464,
        "deepseek_false": 609,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 464,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "git",
        "http_url": "https://github.com/git/git.git",
        "ssh_url": "git@github.com:git/git.git",
        "summary": "The **git** repository is the official source code for Git, a fast, scalable, and distributed version control system originally created by Linus Torvalds. It provides a rich set of commands for both high-level operations and low-level internals, making it a powerful tool for managing code and collaborative development. The project is open-source under the GNU General Public License (GPLv2) and includes extensive documentation, tutorials, and resources for users and contributors. Development and discussions occur primarily on the Git mailing list, with security issues handled privately.",
        "commit_count": 75801,
        "is_opt_keyword": 3385,
        "deepseek_true": 1048,
        "deepseek_false": 2337,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1048,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "redis",
        "http_url": "https://github.com/redis/redis.git",
        "ssh_url": "git@github.com:redis/redis.git",
        "summary": "The **Redis** repository is the official codebase for Redis, an in-memory data structure store used as a database, cache, and message broker. It provides mutable data structures (e.g., strings, lists, sets) accessible via a client-server model, with features like persistence, replication, clustering, and high availability. The repository includes the core Redis server implementation in C, along with tools for building, testing, and deploying Redis on various platforms. It supports advanced functionalities like TLS encryption, systemd integration, and custom memory allocators, making it suitable for both development and production environments.",
        "commit_count": 11959,
        "is_opt_keyword": 616,
        "deepseek_true": 250,
        "deepseek_false": 366,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 250,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "Flipper",
        "http_url": "https://github.com/flipperdevices/flipperzero-firmware.git",
        "ssh_url": "git@github.com:flipperdevices/flipperzero-firmware.git",
        "summary": "The **Flipper Zero Firmware** repository is the official firmware source code for the Flipper Zero, a versatile multi-tool device designed for hacking, debugging, and interacting with various hardware and software systems. The firmware is primarily written in C, with some components in C++ and armv7m assembly, and supports development on Windows, macOS, and Linux. Key features include a modular build system, support for external applications, and extensive documentation for both users and developers. The project encourages community contributions, with guidelines for reporting issues, submitting code, and adhering to coding standards.",
        "commit_count": 2614,
        "is_opt_keyword": 7,
        "deepseek_true": 0,
        "deepseek_false": 7,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 0,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "reactos",
        "http_url": "https://github.com/reactos/reactos.git",
        "ssh_url": "git@github.com:reactos/reactos.git",
        "summary": "The **ReactOS** repository is an open-source project aimed at developing a free operating system that is compatible with applications and drivers designed for Microsoft Windows NT-based systems (e.g., Windows XP, 2003, 7). It focuses on providing a Windows-like experience without being a wrapper or competing with Linux-based systems. Key features include compatibility with Windows Server 2003, experimental support for BtrFS, and a user-mode component based on WINE. The project is licensed under GNU GPL 2.0 and is in the alpha stage, requiring caution during testing. It supports building with tools like the ReactOS Build Environment (RosBE) or Microsoft Visual C++. Contributions are welcome, but contributors must avoid exposure to proprietary Windows source code to prevent copyright issues.",
        "commit_count": 86448,
        "is_opt_keyword": 3175,
        "deepseek_true": 343,
        "deepseek_false": 2832,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 343,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "flameshot",
        "http_url": "https://github.com/flameshot-org/flameshot.git",
        "ssh_url": "git@github.com:flameshot-org/flameshot.git",
        "summary": "The **Flameshot** repository is a powerful and user-friendly screenshot tool designed for Linux, Windows, and macOS. It offers features like in-app editing, customizable appearance, DBus interface, and Imgur upload support. The tool supports CLI and GUI usage, with extensive keyboard shortcuts for efficient screenshot capture and editing. Built with **Qt** and **CMake**, Flameshot is highly customizable and integrates well with various desktop environments. It is available via package managers like Snap, Flatpak, and Homebrew, and supports experimental Wayland environments. The project is open-source under the **GPLv3** license and encourages community contributions.",
        "commit_count": 1954,
        "is_opt_keyword": 71,
        "deepseek_true": 3,
        "deepseek_false": 68,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 3,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "react-native",
        "http_url": "https://github.com/facebook/react-native.git",
        "ssh_url": "git@github.com:facebook/react-native.git",
        "summary": "The **React Native** repository is a framework developed by Facebook for building cross-platform mobile applications using React. It allows developers to create native iOS and Android apps with a single codebase, leveraging React's declarative UI and component-based architecture. Key features include live reloading for faster development, reusability across platforms, and access to native UI controls. The project is MIT-licensed, supports contributions, and is widely used in the mobile development ecosystem.",
        "commit_count": 34375,
        "is_opt_keyword": 1488,
        "deepseek_true": 391,
        "deepseek_false": 1097,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 391,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "FFmpeg",
        "http_url": "https://github.com/FFmpeg/FFmpeg.git",
        "ssh_url": "git@github.com:FFmpeg/FFmpeg.git",
        "summary": "FFmpeg is a powerful open-source multimedia framework that provides libraries and tools for processing audio, video, subtitles, and metadata. It includes key libraries like `libavcodec` for codecs, `libavformat` for streaming protocols, and tools like `ffmpeg` for multimedia manipulation, `ffplay` for playback, and `ffprobe` for content inspection. The project is primarily licensed under LGPL, with optional GPL components, and contributions are managed through a mailing list rather than GitHub pull requests.",
        "commit_count": 118248,
        "is_opt_keyword": 2509,
        "deepseek_true": 923,
        "deepseek_false": 1586,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 923,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "raylib",
        "http_url": "https://github.com/raysan5/raylib.git",
        "ssh_url": "git@github.com:raysan5/raylib.git",
        "summary": "**raylib** is a simple and easy-to-use library designed for video game programming, prototyping, and educational purposes. It is written in plain C (C99) and supports multiple platforms, including Windows, Linux, macOS, Android, and HTML5. Key features include hardware-accelerated graphics with OpenGL, full 3D support, VR rendering, audio playback, and bindings for over 70 programming languages. The library is lightweight, with no external dependencies, and includes a rich collection of examples and documentation to facilitate learning and development.",
        "commit_count": 7898,
        "is_opt_keyword": 172,
        "deepseek_true": 15,
        "deepseek_false": 157,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 15,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "flatbuffers",
        "http_url": "https://github.com/google/flatbuffers.git",
        "ssh_url": "git@github.com:google/flatbuffers.git",
        "summary": "The **FlatBuffers** repository is a cross-platform serialization library developed by Google, designed for maximum memory efficiency. It allows direct access to serialized data without parsing, ensuring high performance and compatibility across different programming languages and schema versions. The library supports a wide range of languages (C++, C#, Java, Python, Rust, etc.) and operating systems, and includes tools like the `flatc` compiler for generating language-specific code from schema definitions. It is widely used for efficient data serialization in applications requiring high performance and low memory overhead.",
        "commit_count": 3136,
        "is_opt_keyword": 128,
        "deepseek_true": 37,
        "deepseek_false": 91,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 37,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "radare2",
        "http_url": "https://github.com/radareorg/radare2.git",
        "ssh_url": "git@github.com:radareorg/radare2.git",
        "summary": "The **radare2** repository is a comprehensive, open-source reverse engineering framework designed for Unix-based systems. It provides a suite of tools, libraries, and plugins for analyzing, debugging, and modifying binaries across a wide range of architectures and file formats. Key features include scripting support via embedded JavaScript, remote debugging, and extensive plugin integration (e.g., Ghidra decompiler, Frida, and symbolic execution). Built with a focus on low-level operations, it supports multiple platforms (Windows, Linux, macOS, etc.) and is distributed under LGPLv3, with plugins under various licenses.",
        "commit_count": 33039,
        "is_opt_keyword": 907,
        "deepseek_true": 69,
        "deepseek_false": 838,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 69,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "faiss",
        "http_url": "https://github.com/facebookresearch/faiss.git",
        "ssh_url": "git@github.com:facebookresearch/faiss.git",
        "summary": "Faiss is a highly efficient library developed by Meta's Fundamental AI Research group for similarity search and clustering of dense vectors. It supports both CPU and GPU implementations, enabling fast nearest neighbor search, k-means clustering, and other vector operations, even for datasets that do not fit in RAM. Written in C++ with Python wrappers, Faiss is optimized for performance and scalability, offering various indexing structures and algorithms to balance search speed, accuracy, and memory usage. It is widely used in machine learning and AI applications for tasks like recommendation systems and large-scale data analysis.",
        "commit_count": 1354,
        "is_opt_keyword": 102,
        "deepseek_true": 39,
        "deepseek_false": 63,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 39,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "qmk_firmware",
        "http_url": "https://github.com/qmk/qmk_firmware.git",
        "ssh_url": "git@github.com:qmk/qmk_firmware.git",
        "summary": "The **qmk_firmware** repository is a keyboard firmware designed for custom mechanical keyboards, built on the **tmk_keyboard** firmware. It supports a variety of keyboards, including the **OLKB product line**, **ErgoDox EZ**, and **Clueboard**, and is compatible with Atmel AVR and ARM controllers. The project is community-driven, with extensive documentation powered by **VitePress**, and is maintained by key contributors like Jack Humbert and others. The official website, [qmk.fm](https://qmk.fm), provides additional resources and support.",
        "commit_count": 28275,
        "is_opt_keyword": 466,
        "deepseek_true": 31,
        "deepseek_false": 435,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 31,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ExplorerPatcher",
        "http_url": "https://github.com/valinet/ExplorerPatcher.git",
        "ssh_url": "git@github.com:valinet/ExplorerPatcher.git",
        "summary": "ExplorerPatcher is a Windows utility designed to enhance the user experience by allowing customization of the taskbar, Start menu, and Alt+Tab functionality, particularly enabling Windows 10-style features on Windows 11. It supports both x64 and ARM64 processors and includes built-in update functionality. The tool is distributed via an installer and can be easily configured or uninstalled through the system settings or command-line options. The project is actively maintained, with a focus on compatibility with newer Windows builds, and offers community support through a Discord server.",
        "commit_count": 931,
        "is_opt_keyword": 30,
        "deepseek_true": 1,
        "deepseek_false": 29,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "qBittorrent",
        "http_url": "https://github.com/qbittorrent/qBittorrent.git",
        "ssh_url": "git@github.com:qbittorrent/qBittorrent.git",
        "summary": "qBittorrent is an open-source BitTorrent client written in C++ using the Qt framework and libtorrent library. It aims to provide a fast, stable, and feature-rich alternative to other BitTorrent clients, with support for Unicode and additional functionalities like IP-to-country resolution using the DB-IP database. The project emphasizes security by signing its releases and offers extensive documentation, community support, and bug tracking through its website, wiki, and forums.",
        "commit_count": 13107,
        "is_opt_keyword": 680,
        "deepseek_true": 68,
        "deepseek_false": 612,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 68,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "esp-idf",
        "http_url": "https://github.com/espressif/esp-idf.git",
        "ssh_url": "git@github.com:espressif/esp-idf.git",
        "summary": "The **esp-idf** repository is the official development framework for Espressif's IoT-focused System on Chips (SoCs), including ESP32, ESP32-S2, ESP32-C3, and others. It provides tools and libraries for developing, building, and flashing firmware onto Espressif devices, supported on Windows, Linux, and macOS. Key features include project configuration, serial monitoring, and compatibility with multiple SoC versions, with detailed documentation and example projects provided. The framework uses tools like `idf.py` for project management and integrates with Espressif's hardware ecosystem.",
        "commit_count": 41763,
        "is_opt_keyword": 1097,
        "deepseek_true": 293,
        "deepseek_false": 804,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 293,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "protobuf",
        "http_url": "https://github.com/protocolbuffers/protobuf.git",
        "ssh_url": "git@github.com:protocolbuffers/protobuf.git",
        "summary": "The **protobuf** repository is the official implementation of Google's Protocol Buffers, a language-neutral, platform-neutral mechanism for serializing structured data. It provides a compiler (`protoc`) and runtime libraries for multiple programming languages, including C++, Java, Python, and Go, enabling efficient data interchange. The repository supports installation via pre-built binaries or source builds, with detailed documentation and tutorials available for getting started. It is widely used for data serialization in distributed systems and APIs.",
        "commit_count": 19799,
        "is_opt_keyword": 433,
        "deepseek_true": 183,
        "deepseek_false": 250,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 183,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "envoy",
        "http_url": "https://github.com/envoyproxy/envoy.git",
        "ssh_url": "git@github.com:envoyproxy/envoy.git",
        "summary": "The **Envoy** repository is a cloud-native, high-performance proxy designed for edge, middle, and service layers, hosted by the Cloud Native Computing Foundation (CNCF). It provides advanced features like load balancing, observability, and dynamic service discovery, making it ideal for microservices architectures. Built with modern C++, Envoy supports extensive customization through filters and APIs, and it is widely used in production environments with robust security audits and community-driven development.",
        "commit_count": 23659,
        "is_opt_keyword": 662,
        "deepseek_true": 209,
        "deepseek_false": 453,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 209,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "Proton",
        "http_url": "https://github.com/ValveSoftware/Proton.git",
        "ssh_url": "git@github.com:ValveSoftware/Proton.git",
        "summary": "**Proton** is a tool developed by Valve Software that enables Windows-exclusive games to run on Linux through the Steam client. It leverages **Wine** to achieve compatibility and provides advanced users with the ability to customize and build their own versions of Proton. The repository includes build instructions using **Docker** or **Podman**, and supports features like debugging, runtime configuration, and integration with tools like **clangd** for development. Proton is primarily distributed through Steam, but the source code is available for customization and experimentation.",
        "commit_count": 2047,
        "is_opt_keyword": 10,
        "deepseek_true": 0,
        "deepseek_false": 10,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 0,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "emscripten",
        "http_url": "https://github.com/emscripten-core/emscripten.git",
        "ssh_url": "git@github.com:emscripten-core/emscripten.git",
        "summary": "The **Emscripten** repository is a compiler toolchain that converts C and C++ code into WebAssembly using LLVM and Binaryen, enabling execution on the web, Node.js, and standalone wasm runtimes. It supports popular APIs like OpenGL and SDL2, making it suitable for porting complex applications such as Unity and Google Earth to the web. Emscripten is primarily MIT-licensed, integrates with LLVM-based compilers like Clang, and is widely used for web-based deployment of native applications.",
        "commit_count": 27845,
        "is_opt_keyword": 1738,
        "deepseek_true": 284,
        "deepseek_false": 1454,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 284,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "postgres",
        "http_url": "https://github.com/postgres/postgres.git",
        "ssh_url": "git@github.com:postgres/postgres.git",
        "summary": "The repository contains the source code for **PostgreSQL**, an advanced, open-source, object-relational database management system (DBMS). It supports a wide range of SQL features, including transactions, foreign keys, triggers, and user-defined types and functions, along with C language bindings. The repository provides documentation for building PostgreSQL from source and links to the official website for downloads and further information.",
        "commit_count": 60171,
        "is_opt_keyword": 4767,
        "deepseek_true": 1069,
        "deepseek_false": 3698,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1069,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ecapture",
        "http_url": "https://github.com/ehids/ecapture.git",
        "ssh_url": "git@github.com:ehids/ecapture.git",
        "summary": "The **ecapture** repository is a tool designed to capture SSL/TLS plaintext content without requiring a CA certificate, leveraging **eBPF (Extended Berkeley Packet Filter)** technology. It supports various encryption libraries like OpenSSL, GnuTLS, BoringSSL, and GoTLS, and can also audit commands in Bash, Zsh, MySQL, and PostgreSQL. Key features include capturing plaintext data in multiple formats (pcap, keylog, text) and supporting Linux/Android kernels (x86_64 and aarch64). The tool requires root access and is not compatible with Windows or macOS. It is particularly useful for security auditing and debugging encrypted communications.",
        "commit_count": 905,
        "is_opt_keyword": 22,
        "deepseek_true": 4,
        "deepseek_false": 18,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 4,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "openwrt",
        "http_url": "https://github.com/openwrt/openwrt.git",
        "ssh_url": "git@github.com:openwrt/openwrt.git",
        "summary": "The **OpenWrt** repository is a Linux-based operating system designed for embedded devices, particularly WiFi routers, offering a fully writable filesystem with package management for extensive customization. Key features include the ability to build custom firmware, support for a wide range of hardware, and a modular web interface (LuCI) for device management. It leverages tools like `opkg` for package management and supports cross-compilation for various architectures, with development requiring a case-sensitive filesystem on Linux, BSD, or macOS. OpenWrt is licensed under GPL-2.0 and is supported by an active community with extensive documentation and forums.",
        "commit_count": 62982,
        "is_opt_keyword": 1650,
        "deepseek_true": 447,
        "deepseek_false": 1203,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 447,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "netdata",
        "http_url": "https://github.com/netdata/netdata.git",
        "ssh_url": "git@github.com:netdata/netdata.git",
        "summary": "The **netdata** repository is a high-performance, real-time monitoring and observability platform designed to provide comprehensive insights into servers, containers, and applications. Key features include per-second data collection, zero-configuration setup, machine learning-powered anomaly detection, and advanced visualization dashboards. It supports a wide range of systems (Linux, macOS, FreeBSD, and soon Windows) and integrates with over 800 data sources. The core **Netdata Agent** is open-source (GPLv3+), while the ecosystem includes closed-source components like **Netdata Cloud** for enterprise-grade features and **Netdata UI** for visualization. The platform is highly scalable, energy-efficient, and optimized for minimal resource usage, making it suitable for both small setups and large, distributed infrastructures.",
        "commit_count": 19530,
        "is_opt_keyword": 635,
        "deepseek_true": 104,
        "deepseek_false": 531,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 104,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "electron",
        "http_url": "https://github.com/electron/electron.git",
        "ssh_url": "git@github.com:electron/electron.git",
        "summary": "The **Electron** repository is the core framework for building cross-platform desktop applications using JavaScript, HTML, and CSS. It leverages **Node.js** and **Chromium** to enable developers to create applications that run on macOS, Windows, and Linux. Key features include prebuilt binaries for multiple platforms, integration with tools like **Electron Fiddle** for experimentation, and extensive documentation with community-driven translations. Popular applications like **Visual Studio Code** are built using Electron.",
        "commit_count": 28851,
        "is_opt_keyword": 356,
        "deepseek_true": 31,
        "deepseek_false": 325,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 31,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "php-src",
        "http_url": "https://github.com/php/php-src.git",
        "ssh_url": "git@github.com:php/php-src.git",
        "summary": "The **php-src** repository contains the source code for the PHP interpreter, a widely-used scripting language for web development. It provides instructions for building PHP from source, testing the codebase, and installing custom builds. The repository supports contributions through pull requests and follows a structured process for feature requests and bug fixes. Key technologies include autoconf, bison, and re2c for building, and the project is maintained with extensive documentation and testing workflows.",
        "commit_count": 139944,
        "is_opt_keyword": 3059,
        "deepseek_true": 584,
        "deepseek_false": 2475,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 584,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "json",
        "http_url": "https://github.com/nlohmann/json.git",
        "ssh_url": "git@github.com:nlohmann/json.git",
        "summary": "The **nlohmann/json** repository is a widely-used C++ library for parsing, serializing, and manipulating JSON data. It is designed to be intuitive, easy to integrate, and highly efficient, offering features like:\n\n1. **Single-header inclusion**: The library is header-only, requiring no complex build systems or dependencies.\n2. **Modern C++ support**: It leverages C++11 features for a clean and expressive API.\n3. **Extensive functionality**: Supports JSON parsing, serialization, binary formats (BSON, CBOR, MessagePack, UBJSON, BJData), and user-defined type conversions.\n4. **Cross-platform compatibility**: Works with major compilers (GCC, Clang, MSVC) and platforms (Windows, macOS, Linux).\n5. **Robust testing**: Heavily unit-tested with 100% code coverage, fuzz testing, and memory leak checks.\n\nThe library is widely adopted in various projects and operating systems, including Apple's macOS and iOS. It is licensed under the MIT license and supports integration via CMake, package managers (e.g., Conan, vcpkg), and other build systems.",
        "commit_count": 4647,
        "is_opt_keyword": 132,
        "deepseek_true": 21,
        "deepseek_false": 111,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 21,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "dragonfly",
        "http_url": "https://github.com/dragonflydb/dragonfly.git",
        "ssh_url": "git@github.com:dragonflydb/dragonfly.git",
        "summary": "Dragonfly is a high-performance, in-memory data store designed for modern application workloads, offering full compatibility with Redis and Memcached APIs without requiring code changes. It delivers up to 25x higher throughput, lower latency, and significantly better memory efficiency compared to traditional solutions like Redis and Memcached. Built using a shared-nothing architecture and advanced data structures like Dash, Dragonfly supports ~185 Redis commands and all Memcached commands (except `cas`), with features like adaptive caching, efficient snapshotting, and Prometheus-compatible metrics. It is optimized for cloud environments, aiming to provide a cost-efficient, ultra-fast alternative to legacy in-memory data stores.",
        "commit_count": 3011,
        "is_opt_keyword": 142,
        "deepseek_true": 38,
        "deepseek_false": 104,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 38,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "openssl",
        "http_url": "https://github.com/openssl/openssl.git",
        "ssh_url": "git@github.com:openssl/openssl.git",
        "summary": "The **OpenSSL** repository is a robust, open-source toolkit for implementing the TLS, DTLS, and QUIC (client-side) protocols, along with a comprehensive cryptographic library. It provides tools for encryption, certificate management, and protocol testing, and includes a FIPS-validated cryptographic module. The project is widely used for secure communication and is maintained under the Apache License 2.0, with development primarily conducted via GitHub pull requests.",
        "commit_count": 36157,
        "is_opt_keyword": 878,
        "deepseek_true": 297,
        "deepseek_false": 581,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 297,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "zstd",
        "http_url": "https://github.com/facebook/zstd.git",
        "ssh_url": "git@github.com:facebook/zstd.git",
        "summary": "The **zstd** repository is the reference implementation of the Zstandard (zstd) compression algorithm, developed by Facebook. It provides a fast, lossless compression algorithm that achieves high compression ratios and real-time performance, outperforming zlib in many scenarios. The repository includes a C library and a command-line utility for compressing and decompressing files in formats like `.zst`, `.gz`, `.xz`, and `.lz4`. It supports advanced features like dictionary-based compression for small data and is dual-licensed under BSD and GPLv2. The project is widely used in production environments and offers extensive build options, including Make, CMake, and Meson.",
        "commit_count": 10927,
        "is_opt_keyword": 468,
        "deepseek_true": 130,
        "deepseek_false": 338,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 130,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "duckdb",
        "http_url": "https://github.com/duckdb/duckdb.git",
        "ssh_url": "git@github.com:duckdb/duckdb.git",
        "summary": "DuckDB is a high-performance, in-process analytical database designed for fast and efficient data analysis. It supports a rich SQL dialect with advanced features like nested subqueries, window functions, and complex data types, and integrates seamlessly with popular tools like pandas and dplyr. The database is available as a standalone CLI application and offers client libraries for Python, R, Java, and Wasm. Built with C++ and requiring CMake for development, DuckDB is portable, easy to use, and optimized for analytical workloads.",
        "commit_count": 52593,
        "is_opt_keyword": 939,
        "deepseek_true": 150,
        "deepseek_false": 789,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 150,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "opencv",
        "http_url": "https://github.com/opencv/opencv.git",
        "ssh_url": "git@github.com:opencv/opencv.git",
        "summary": "The **OpenCV** repository is the official source code for the Open Source Computer Vision Library, a widely-used library for computer vision and machine learning tasks. It provides tools for image and video processing, object detection, and more, with extensive documentation, community support, and additional functionality available through the `opencv_contrib` repository. The project encourages contributions, follows strict coding guidelines, and offers resources like courses, forums, and live streams to support developers and researchers in the computer vision field.",
        "commit_count": 34800,
        "is_opt_keyword": 1476,
        "deepseek_true": 263,
        "deepseek_false": 1213,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 263,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "yabai",
        "http_url": "https://github.com/koekeishiya/yabai.git",
        "ssh_url": "git@github.com:koekeishiya/yabai.git",
        "summary": "**yabai** is a tiling window management utility for macOS, designed to extend the built-in window manager by providing advanced control over windows, spaces, and displays. It features a command-line interface, focus-follows-mouse functionality, and the ability to disable animations, create additional spaces, and manage window layouts using a binary space partitioning algorithm. The tool requires specific macOS versions and permissions (e.g., Accessibility API, Screen Recording) and can optionally integrate with **skhd** for keyboard shortcuts. It is licensed under the MIT License and supports macOS Big Sur and later versions.",
        "commit_count": 1602,
        "is_opt_keyword": 18,
        "deepseek_true": 0,
        "deepseek_false": 18,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 0,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "cmder",
        "http_url": "https://github.com/cmderdev/cmder.git",
        "ssh_url": "git@github.com:cmderdev/cmder.git",
        "summary": "**Cmder** is a portable console emulator for Windows designed to enhance the default command-line experience. It is built on **ConEmu** and includes features like a **Monokai color scheme**, **clink** for command-line enhancements, and a customizable prompt layout. Key functionalities include support for multiple shells (e.g., CMD, PowerShell, Bash) in tabbed interfaces, portability for USB or cloud storage, and integration with tools like Git. It also offers extensive customization options for aliases, shell behavior, and appearance, making it a versatile tool for developers and power users.",
        "commit_count": 1711,
        "is_opt_keyword": 27,
        "deepseek_true": 8,
        "deepseek_false": 19,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 8,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "obs-studio",
        "http_url": "https://github.com/obsproject/obs-studio.git",
        "ssh_url": "git@github.com:obsproject/obs-studio.git",
        "summary": "The **obs-studio** repository is the official codebase for OBS Studio, a powerful open-source software designed for video capturing, compositing, encoding, recording, and streaming. It supports a wide range of features for content creators and is distributed under the GNU General Public License v2. The project leverages GitHub Actions for CI/CD, Crowdin for translations, and encourages community contributions through code, translations, and support. Key technologies include C/C++ (as indicated by the PVS-Studio static analyzer), and the project is actively maintained with extensive documentation and community engagement.",
        "commit_count": 14666,
        "is_opt_keyword": 317,
        "deepseek_true": 63,
        "deepseek_false": 254,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 63,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "xgboost",
        "http_url": "https://github.com/dmlc/xgboost.git",
        "ssh_url": "git@github.com:dmlc/xgboost.git",
        "summary": "The **xgboost** repository is a highly optimized, distributed gradient boosting library designed for efficiency, flexibility, and portability. It implements machine learning algorithms under the Gradient Boosting framework, enabling fast and accurate solutions for data science problems, even on large-scale datasets. The library supports major distributed environments like Kubernetes, Hadoop, and Spark, and is widely used in both research and industry. It is licensed under Apache-2 and maintained by an active community, with integrations for Python, R, and other platforms.",
        "commit_count": 7280,
        "is_opt_keyword": 196,
        "deepseek_true": 44,
        "deepseek_false": 152,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 44,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "cosmopolitan",
        "http_url": "https://github.com/jart/cosmopolitan.git",
        "ssh_url": "git@github.com:jart/cosmopolitan.git",
        "summary": "The **Cosmopolitan** repository provides the **Cosmopolitan Libc**, a C library that enables **build-once, run-anywhere** executables, similar to Java but without requiring a virtual machine. It supports multiple platforms, including Linux, macOS, Windows, and BSD variants, by reconfiguring GCC and Clang to produce a **POSIX-approved polyglot format**. Key features include **tiny binary sizes**, **cross-platform compatibility**, and built-in debugging tools like `strace` and `ftrace`. The project uses **GCC/Clang** and provides a custom compiler (`cosmocc`) for building portable C programs.",
        "commit_count": 2718,
        "is_opt_keyword": 322,
        "deepseek_true": 60,
        "deepseek_false": 262,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 60,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "nnn",
        "http_url": "https://github.com/jarun/nnn.git",
        "ssh_url": "git@github.com:jarun/nnn.git",
        "summary": "The **nnn** repository is a highly efficient, terminal-based file manager designed to boost productivity with minimal configuration. It offers features like disk usage analysis, batch renaming, file picking, and extensive plugin support for tasks such as live previews, file uploads, and disk management. Built for speed and privacy, it is lightweight (under 3.5MB memory usage), portable across platforms (Linux, macOS, Android, etc.), and supports plugins, custom workflows, and integrations with tools like (neo)vim. Its focus on simplicity, performance, and extensibility makes it ideal for power users and developers.",
        "commit_count": 4408,
        "is_opt_keyword": 91,
        "deepseek_true": 8,
        "deepseek_false": 83,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 8,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "x64dbg",
        "http_url": "https://github.com/x64dbg/x64dbg.git",
        "ssh_url": "git@github.com:x64dbg/x64dbg.git",
        "summary": "x64dbg is an open-source binary debugger for Windows, designed for malware analysis and reverse engineering of executables without source code access. It supports both 32-bit and 64-bit architectures and offers a comprehensive plugin system for extensibility. The project leverages technologies like TitanEngine, Zydis, and Scylla, and is maintained by a community of developers, with contributions encouraged through pull requests and issue tracking.",
        "commit_count": 5502,
        "is_opt_keyword": 231,
        "deepseek_true": 34,
        "deepseek_false": 197,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 34,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ClickHouse",
        "http_url": "https://github.com/ClickHouse/ClickHouse.git",
        "ssh_url": "git@github.com:ClickHouse/ClickHouse.git",
        "summary": "ClickHouse is an open-source, column-oriented database management system designed for real-time analytical data reporting. It offers high performance for generating analytical insights and supports features like real-time querying and scalability. The repository provides installation instructions, extensive documentation, and community resources, including tutorials, meetups, and a cloud service. It is licensed under Apache 2.0 and actively maintained by a globally distributed team.",
        "commit_count": 162534,
        "is_opt_keyword": 5424,
        "deepseek_true": 719,
        "deepseek_false": 4704,
        "deepseek_unknown": 1,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 719,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "nginx",
        "http_url": "https://github.com/nginx/nginx.git",
        "ssh_url": "git@github.com:nginx/nginx.git",
        "summary": "The **nginx** repository hosts the source code for NGINX, a high-performance web server, load balancer, reverse proxy, API gateway, and content cache. It is widely used for its efficiency and scalability, supporting both static and dynamic modules for extended functionality. The repository provides detailed documentation for installation, configuration, and building from source, along with resources for SSL/TLS, load balancing, rate limiting, and caching. NGINX is open-source, distributed under a 2-clause BSD-like license, and offers enterprise support through F5, Inc.",
        "commit_count": 8321,
        "is_opt_keyword": 172,
        "deepseek_true": 50,
        "deepseek_false": 122,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 50,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "whisper.cpp",
        "http_url": "https://github.com/ggerganov/whisper.cpp.git",
        "ssh_url": "git@github.com:ggerganov/whisper.cpp.git",
        "summary": "The **whisper.cpp** repository is a high-performance, lightweight C/C++ implementation of OpenAI's Whisper automatic speech recognition (ASR) model. It is designed for efficient inference across various platforms, including Apple Silicon (optimized with ARM NEON, Metal, and Core ML), x86 (AVX), and POWER architectures, with support for CPU-only and GPU-accelerated inference via NVIDIA, Vulkan, and OpenVINO. Key features include zero runtime memory allocations, integer quantization, and support for multiple platforms like iOS, Android, WebAssembly, and Raspberry Pi. The repository also provides tools for real-time transcription, speaker segmentation, and karaoke-style video generation, making it versatile for offline voice applications.",
        "commit_count": 2033,
        "is_opt_keyword": 134,
        "deepseek_true": 61,
        "deepseek_false": 73,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 61,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "mysql-server",
        "http_url": "https://github.com/mysql/mysql-server.git",
        "ssh_url": "git@github.com:mysql/mysql-server.git",
        "summary": "The **mysql-server** repository is the official source code for MySQL, a widely-used open-source SQL database server developed and maintained by Oracle. It provides the core functionality for managing relational databases, supporting SQL queries, transactions, and more. The repository includes licensing details and links to official documentation and downloads, making it a central resource for developers working with MySQL.",
        "commit_count": 184772,
        "is_opt_keyword": 7100,
        "deepseek_true": 1409,
        "deepseek_false": 5691,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1409,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "winget-cli",
        "http_url": "https://github.com/microsoft/winget-cli.git",
        "ssh_url": "git@github.com:microsoft/winget-cli.git",
        "summary": "The **winget-cli** repository is the official source code for the **Windows Package Manager (WinGet)**, a command-line tool designed to simplify the discovery, installation, and management of software packages on Windows. Key features include access to packages from the Microsoft Store and the WinGet community repository, support for custom REST-based sources, and experimental features for developers. Built using C++ and Visual Studio, the tool requires Windows 10 1809 or later and integrates with the Microsoft Store for updates. The repository encourages community contributions and provides detailed instructions for building and customizing the client.",
        "commit_count": 1323,
        "is_opt_keyword": 59,
        "deepseek_true": 4,
        "deepseek_false": 55,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 4,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "mpv",
        "http_url": "https://github.com/mpv-player/mpv.git",
        "ssh_url": "git@github.com:mpv-player/mpv.git",
        "summary": "The **mpv** repository is a free, open-source media player designed for command-line use, supporting a wide range of media formats, codecs, and subtitles. Key features include hardware decoding, customizable playback profiles, and integration with external libraries like FFmpeg and libass. Built using **Meson**, it requires dependencies such as X development headers, audio output libraries, and Lua for optional features like GUI and YouTube-DL integration. The project is actively maintained, with releases aimed at Linux distributions, and contributions are encouraged through GitHub and IRC channels.",
        "commit_count": 53511,
        "is_opt_keyword": 1169,
        "deepseek_true": 251,
        "deepseek_false": 918,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 251,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "vlc",
        "http_url": "https://github.com/videolan/vlc.git",
        "ssh_url": "git@github.com:videolan/vlc.git",
        "summary": "The **VLC repository** is the core codebase for the VLC media player, a widely-used, open-source multimedia player and engine capable of playing, converting, and streaming nearly any media format across multiple platforms. It supports a wide range of operating systems, including Windows, macOS, Linux, Android, and iOS, and its engine, **libVLC**, can be embedded into third-party applications. The project is primarily written in C, with contributions in C++, Obj-C, asm, and Rust, and is maintained by a global community of volunteers under the GPLv2 (or later) license.",
        "commit_count": 105717,
        "is_opt_keyword": 1363,
        "deepseek_true": 220,
        "deepseek_false": 1143,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 220,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "mongo",
        "http_url": "https://github.com/mongodb/mongo.git",
        "ssh_url": "git@github.com:mongodb/mongo.git",
        "summary": "The repository is the official source code for MongoDB, a popular NoSQL database. It includes core components like `mongod` (database server) and `mongos` (sharding router), along with instructions for downloading, building, and running MongoDB. The project supports various installation methods (e.g., Homebrew, Docker) and provides tools like MongoDB Shell (`mongosh`) and Compass for database management. It is licensed under the Server Side Public License (SSPL) v1, with resources for learning, bug reporting, and community forums available.",
        "commit_count": 85832,
        "is_opt_keyword": 1730,
        "deepseek_true": 294,
        "deepseek_false": 1436,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 294,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "carbon-lang",
        "http_url": "https://github.com/carbon-language/carbon-lang.git",
        "ssh_url": "git@github.com:carbon-language/carbon-lang.git",
        "summary": "The **carbon-lang** repository is an experimental project aimed at developing **Carbon**, a potential successor to C++ designed for performance-critical software. Key features include seamless interoperability with C++, modern language constructs like a generics system, and a focus on memory safety and developer-friendly syntax. Built using **LLVM**, Carbon emphasizes performance, scalability, and a gentle learning curve for C++ developers, while fostering an open-source community for collaboration and contributions. The project is still in early development, with a roadmap targeting a functional toolchain and C++ interop by 2024.",
        "commit_count": 3309,
        "is_opt_keyword": 184,
        "deepseek_true": 45,
        "deepseek_false": 139,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 45,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "valkey",
        "http_url": "https://github.com/valkey-io/valkey.git",
        "ssh_url": "git@github.com:valkey-io/valkey.git",
        "summary": "Valkey is a high-performance key/value data structure server forked from Redis, designed to handle a wide range of native data structures and support extensible plugins for new data types and access patterns. It offers features like TLS and RDMA support, with build options for various platforms and allocators. Valkey is maintained as an open-source project under LF Projects, emphasizing community contributions and security.",
        "commit_count": 12834,
        "is_opt_keyword": 656,
        "deepseek_true": 270,
        "deepseek_false": 386,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 270,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "micropython",
        "http_url": "https://github.com/micropython/micropython.git",
        "ssh_url": "git@github.com:micropython/micropython.git",
        "summary": "The **MicroPython** repository is a lightweight implementation of Python 3.x designed to run on microcontrollers and small embedded systems. It supports a subset of Python 3.4+ syntax, including features like `async`/`await`, and provides core data types and modules such as `os`, `sys`, and `time`. Key functionalities include hardware-specific modules for GPIO, I2C, SPI, and more, as well as the ability to execute scripts from source or precompiled bytecode. The project supports a wide range of platforms, including Unix, Windows, and various microcontrollers like ESP32, STM32, and Raspberry Pi RP2040, and uses tools like `make`, `gcc`, and `CMake` for building. It is open-source under the MIT license and encourages community contributions.",
        "commit_count": 16575,
        "is_opt_keyword": 532,
        "deepseek_true": 147,
        "deepseek_false": 385,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 147,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "calculator",
        "http_url": "https://github.com/microsoft/calculator.git",
        "ssh_url": "git@github.com:microsoft/calculator.git",
        "summary": "The **Calculator** repository by Microsoft hosts the source code for the Windows Calculator app, a modern application written in **C++** and **C#** that ships pre-installed with Windows. It offers a wide range of functionalities, including standard, scientific, and programmer calculator modes, unit and currency conversion, date calculations, and infinite precision arithmetic. The project is built using **Visual Studio** with **Universal Windows Platform (UWP)** tools and encourages community contributions. It also includes a roadmap for future features like graphing mode and adheres to the **MIT License**.",
        "commit_count": 863,
        "is_opt_keyword": 32,
        "deepseek_true": 6,
        "deepseek_false": 26,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 6,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "unleashed-firmware",
        "http_url": "https://github.com/DarkFlippers/unleashed-firmware.git",
        "ssh_url": "git@github.com:DarkFlippers/unleashed-firmware.git",
        "summary": "The **unleashed-firmware** repository is a custom firmware fork for the Flipper Zero device, focusing on enhancing and expanding the features of the original firmware. Key features include extended Sub-GHz frequency support, new protocols for RF communication, external hardware integration (e.g., CC1101 modules), and improved apps for NFC, RFID, and infrared functionalities. The firmware is community-driven, with contributions from developers and enthusiasts, and emphasizes experimental use while discouraging illegal activities. It is built on the original Flipper Zero firmware and includes a variety of plugins, tools, and documentation for customization and development.",
        "commit_count": 7266,
        "is_opt_keyword": 249,
        "deepseek_true": 19,
        "deepseek_false": 230,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 19,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "mediapipe",
        "http_url": "https://github.com/google/mediapipe.git",
        "ssh_url": "git@github.com:google/mediapipe.git",
        "summary": "The **MediaPipe** repository, developed by Google, is a framework for building on-device machine learning (ML) pipelines, enabling the deployment of ML solutions across mobile (Android, iOS), web, desktop, and IoT devices. It provides pre-trained models and tools like **MediaPipe Tasks** and **MediaPipe Studio** for vision, text, and audio tasks, along with customization options using **MediaPipe Model Maker**. The framework supports low-level ML pipeline development in C++, Android, and iOS, emphasizing efficiency and cross-platform compatibility. MediaPipe is widely used for real-time applications like hand tracking, pose estimation, and object detection.",
        "commit_count": 4386,
        "is_opt_keyword": 39,
        "deepseek_true": 9,
        "deepseek_false": 30,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 9,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "v8",
        "http_url": "https://github.com/v8/v8.git",
        "ssh_url": "git@github.com:v8/v8.git",
        "summary": "The **v8** repository hosts Google's open-source **V8 JavaScript engine**, which implements ECMAScript as specified in ECMA-262. Written in **C++**, V8 is the engine powering **Google Chrome** and can be used standalone or embedded in C++ applications. The repository provides instructions for fetching the code using **depot tools** and contributing to the project, with detailed documentation available at [v8.dev](https://v8.dev/docs).",
        "commit_count": 92441,
        "is_opt_keyword": 7112,
        "deepseek_true": 3711,
        "deepseek_false": 3401,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 3711,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "masscan",
        "http_url": "https://github.com/robertdavidgraham/masscan.git",
        "ssh_url": "git@github.com:robertdavidgraham/masscan.git",
        "summary": "The **masscan** repository is a high-performance Internet-scale port scanner capable of scanning the entire Internet in under 5 minutes by transmitting 10 million packets per second from a single machine. It is designed for large-scale network scanning, with features like asynchronous transmission, banner checking for various protocols, and support for both IPv4 and IPv6. The tool uses its own ad hoc TCP/IP stack and is optimized for speed, leveraging technologies like PF_RING for high packet rates. It is written in C, compatible with Linux, Windows, and macOS, and offers nmap-like usage for familiarity. The project emphasizes safety, scalability, and portability, with a focus on avoiding kernel bottlenecks for maximum performance.",
        "commit_count": 862,
        "is_opt_keyword": 10,
        "deepseek_true": 1,
        "deepseek_false": 9,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "tmux",
        "http_url": "https://github.com/tmux/tmux.git",
        "ssh_url": "git@github.com:tmux/tmux.git",
        "summary": "The **tmux** repository is a terminal multiplexer that allows users to create, access, and control multiple terminal sessions from a single screen. It supports detaching and reattaching sessions, making it ideal for remote work. The tool is compatible with various operating systems, including OpenBSD, FreeBSD, Linux, macOS, and Solaris, and relies on **libevent** and **ncurses** for functionality. It is built using a C compiler, **make**, and **pkg-config**, with installation and contribution instructions provided for both release tarballs and version control.",
        "commit_count": 10428,
        "is_opt_keyword": 51,
        "deepseek_true": 11,
        "deepseek_false": 40,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 11,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "Magisk",
        "http_url": "https://github.com/topjohnwu/Magisk.git",
        "ssh_url": "git@github.com:topjohnwu/Magisk.git",
        "summary": "Magisk is an open-source tool for customizing Android devices, primarily aimed at providing root access and modifying system partitions. Key features include **MagiskSU** for root access, **Magisk Modules** for system modifications, **MagiskBoot** for boot image manipulation, and **Zygisk** for injecting code into Android app processes. It supports devices running Android 6.0 and above and is distributed under the GNU General Public License. The repository also includes detailed documentation, installation instructions, and resources for developers to contribute translations or build custom modules.",
        "commit_count": 7074,
        "is_opt_keyword": 170,
        "deepseek_true": 7,
        "deepseek_false": 163,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 7,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "timescaledb",
        "http_url": "https://github.com/timescale/timescaledb.git",
        "ssh_url": "git@github.com:timescale/timescaledb.git",
        "summary": "TimescaleDB is a PostgreSQL extension designed for high-performance real-time analytics on time-series and event data. It introduces features like hypertables for automatic data partitioning, columnar storage for efficient compression and querying, and continuous aggregates for faster query performance on large datasets. The repository provides installation instructions, usage examples, and integration with Docker, making it suitable for scalable time-series data management. It also supports advanced analytics capabilities like time buckets and offers a managed cloud solution, Timescale Cloud, for production-grade deployments.",
        "commit_count": 5216,
        "is_opt_keyword": 336,
        "deepseek_true": 137,
        "deepseek_false": 199,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 137,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "C-Plus-Plus",
        "http_url": "https://github.com/TheAlgorithms/C-Plus-Plus.git",
        "ssh_url": "git@github.com:TheAlgorithms/C-Plus-Plus.git",
        "summary": "The **C-Plus-Plus** repository is a comprehensive collection of open-source implementations of various algorithms in C++, covering topics like computer science, mathematics, data science, and machine learning. It serves as a learning resource with well-documented, atomic code using C++17 and STL classes, ensuring portability and no external dependencies. The repository is rigorously tested across Windows, MacOS, and Ubuntu, and features detailed online documentation, making it suitable for educators, students, and developers. Contributions are encouraged under MIT and CC BY-SA 4.0 licenses.",
        "commit_count": 1733,
        "is_opt_keyword": 95,
        "deepseek_true": 8,
        "deepseek_false": 87,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 8,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "lvgl",
        "http_url": "https://github.com/lvgl/lvgl.git",
        "ssh_url": "git@github.com:lvgl/lvgl.git",
        "summary": "The **LVGL (Light and Versatile Graphics Library)** repository is a popular open-source embedded graphics library designed for creating modern and beautiful user interfaces (UIs) on microcontrollers (MCUs), microprocessors (MPUs), and various display types. It offers a rich set of features, including 30+ built-in widgets, a flexible style system, web-inspired layout managers, and support for multiple languages and input devices. LVGL is highly portable, requiring minimal resources (32kB RAM, 128kB Flash), and supports platforms like Arduino, ESP-IDF, Zephyr, and more. It also provides extensive documentation, examples, and services for UI design, implementation, and consulting. The library is widely used in embedded systems and supported by major industry players.",
        "commit_count": 10789,
        "is_opt_keyword": 253,
        "deepseek_true": 53,
        "deepseek_false": 200,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 53,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ceph",
        "http_url": "https://github.com/ceph/ceph.git",
        "ssh_url": "git@github.com:ceph/ceph.git",
        "summary": "The **Ceph** repository is a scalable, distributed storage system designed to provide high-performance, reliable, and flexible storage solutions. Key features include support for object, block, and file storage, with a focus on fault tolerance and scalability. The project uses technologies like **CMake** and **Ninja** for building, and it supports various build configurations, including debug and production builds. Contributions are welcome under dual licensing (LGPL/BSD), and the repository includes detailed instructions for building, testing, and running a Ceph cluster.",
        "commit_count": 149950,
        "is_opt_keyword": 3027,
        "deepseek_true": 785,
        "deepseek_false": 2242,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 785,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "tesseract",
        "http_url": "https://github.com/tesseract-ocr/tesseract.git",
        "ssh_url": "git@github.com:tesseract-ocr/tesseract.git",
        "summary": "The **Tesseract OCR** repository is an open-source Optical Character Recognition (OCR) engine that supports over 100 languages and various image formats (e.g., PNG, JPEG, TIFF). It includes both a library (`libtesseract`) for developers and a command-line tool for text extraction. Key features include a neural net-based LSTM OCR engine, support for multiple output formats (e.g., plain text, PDF, hOCR), and the ability to train the engine for additional languages. The project is written in C/C++, depends on the Leptonica library for image processing, and is licensed under Apache 2.0. It is widely used for text recognition tasks but does not include a GUI.",
        "commit_count": 6534,
        "is_opt_keyword": 265,
        "deepseek_true": 43,
        "deepseek_false": 222,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 43,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "bcc",
        "http_url": "https://github.com/iovisor/bcc.git",
        "ssh_url": "git@github.com:iovisor/bcc.git",
        "summary": "The **BPF Compiler Collection (BCC)** is a toolkit designed for creating efficient kernel tracing and manipulation programs using extended BPF (eBPF), a feature available in Linux 4.1 and above. It simplifies the development of BPF programs with kernel instrumentation in C and provides front-ends in Python and Lua, making it ideal for performance analysis, network traffic control, and system troubleshooting. The repository includes a wide range of tools and examples for tracing, monitoring, and debugging various system activities, such as disk I/O, network traffic, and process behavior. Key technologies used include eBPF, LLVM, and Python bindings.",
        "commit_count": 4880,
        "is_opt_keyword": 123,
        "deepseek_true": 15,
        "deepseek_false": 108,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 15,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "llama.cpp",
        "http_url": "https://github.com/ggerganov/llama.cpp.git",
        "ssh_url": "git@github.com:ggerganov/llama.cpp.git",
        "summary": "The **llama.cpp** repository is a C/C++ implementation for efficient inference of Meta's LLaMA models and other large language models (LLMs) with minimal dependencies. It supports a wide range of hardware, including Apple Silicon, x86 architectures, and GPUs (NVIDIA, AMD, and others), with features like integer quantization for faster inference and reduced memory usage. The project includes tools for model quantization, a lightweight OpenAI-compatible HTTP server, and bindings for various programming languages. It is designed for local and cloud deployment, offering state-of-the-art performance with a focus on simplicity and flexibility.",
        "commit_count": 4424,
        "is_opt_keyword": 272,
        "deepseek_true": 128,
        "deepseek_false": 144,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 128,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "tensorflow",
        "http_url": "https://github.com/tensorflow/tensorflow.git",
        "ssh_url": "git@github.com:tensorflow/tensorflow.git",
        "summary": "The **TensorFlow** repository is the official open-source platform for machine learning, developed by Google Brain. It provides a comprehensive ecosystem of tools, libraries, and community resources for building and deploying ML models. Key features include support for Python and C++ APIs, GPU acceleration, and cross-platform compatibility (Linux, macOS, Windows, Android, etc.). TensorFlow is widely used for research, production, and educational purposes, with extensive documentation, tutorials, and community support.",
        "commit_count": 174153,
        "is_opt_keyword": 6494,
        "deepseek_true": 2228,
        "deepseek_false": 4266,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 2228,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "libuv",
        "http_url": "https://github.com/libuv/libuv.git",
        "ssh_url": "git@github.com:libuv/libuv.git",
        "summary": "The **libuv** repository is a multi-platform support library focused on asynchronous I/O, originally developed for Node.js but widely used in other projects like Luvit, Julia, and uvloop. It provides a full-featured event loop and supports asynchronous operations for TCP/UDP sockets, DNS resolution, file systems, child processes, threading, and more. Built with cross-platform compatibility in mind, it uses technologies like epoll, kqueue, and IOCP, and supports build systems like CMake and autotools. The library is licensed under MIT and follows semantic versioning, with extensive documentation and community support.",
        "commit_count": 5466,
        "is_opt_keyword": 139,
        "deepseek_true": 30,
        "deepseek_false": 109,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 30,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "terminal",
        "http_url": "https://github.com/microsoft/terminal.git",
        "ssh_url": "git@github.com:microsoft/terminal.git",
        "summary": "The **Microsoft Terminal** repository contains the source code for **Windows Terminal**, a modern, feature-rich terminal application for Windows, along with the **Windows Console Host** (`conhost.exe`) and shared components between the two. Key features include support for tabs, rich text, theming, and configurability, while maintaining backward compatibility. The project is built using C++ and leverages modernized components like DirectWrite-based rendering and UTF-8/UTF-16 text buffers. It also provides developer tools, sample projects, and detailed documentation for contributing to the project.",
        "commit_count": 4480,
        "is_opt_keyword": 262,
        "deepseek_true": 91,
        "deepseek_false": 171,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 91,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "lede",
        "http_url": "https://github.com/coolsnowwolf/lede.git",
        "ssh_url": "git@github.com:coolsnowwolf/lede.git",
        "summary": "The **lede** repository is a fork of the OpenWrt project, specifically tailored for compiling custom firmware for routers and embedded devices. It includes support for Chinese Loongson (loongarch64) and Phytium D2000 series architectures, making it suitable for a variety of hardware, including soft routers and single-board computers. The repository provides detailed instructions for compiling the firmware on Linux, macOS, and WSL/WSL2, along with a comprehensive list of dependencies. It emphasizes security and transparency, ensuring no backdoors or closed-source software are included. The project also offers community support through QQ and Telegram groups, and encourages donations to support ongoing development.",
        "commit_count": 7143,
        "is_opt_keyword": 157,
        "deepseek_true": 26,
        "deepseek_false": 131,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 26,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "tdesktop",
        "http_url": "https://github.com/telegramdesktop/tdesktop.git",
        "ssh_url": "git@github.com:telegramdesktop/tdesktop.git",
        "summary": "The **tdesktop** repository contains the complete source code and build instructions for the official **Telegram Desktop** messenger client, which is based on the Telegram API and MTProto secure protocol. It supports multiple platforms, including Windows, macOS, and Linux, and utilizes technologies like Qt, OpenSSL, WebRTC, and FFmpeg. The project is open-source under the GPLv3 license with an OpenSSL exception, and it provides detailed build instructions for various operating systems.",
        "commit_count": 19025,
        "is_opt_keyword": 1071,
        "deepseek_true": 46,
        "deepseek_false": 1025,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 46,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "aseprite",
        "http_url": "https://github.com/aseprite/aseprite.git",
        "ssh_url": "git@github.com:aseprite/aseprite.git",
        "summary": "The **Aseprite** repository is a dedicated project for creating animated sprites, primarily aimed at pixel art and game development. Key features include layer and frame management, animation tools (onion skinning, real-time preview), pixel-art-specific tools (shading, custom brushes), and support for various color modes and profiles. It also offers Lua scripting, CLI automation, and cross-platform compatibility. The project is developed by Igara Studio and is distributed under a custom EULA, with additional educational and Steam licensing options.",
        "commit_count": 9768,
        "is_opt_keyword": 178,
        "deepseek_true": 40,
        "deepseek_false": 138,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 40,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "kcp",
        "http_url": "https://github.com/skywind3000/kcp.git",
        "ssh_url": "git@github.com:skywind3000/kcp.git",
        "summary": "The **kcp** repository is a lightweight, fast, and reliable ARQ (Automatic Repeat Request) protocol designed to improve network transmission performance over UDP. It achieves lower latency (30%-40% faster than TCP) at the cost of slightly higher bandwidth usage (10%-20%). Key features include selective retransmission, fast retransmission, and configurable flow control, making it ideal for real-time applications like online gaming and video streaming. The protocol is implemented in just two files (`ikcp.h` and `ikcp.c`), making it easy to integrate into existing projects. It is widely used in both open-source and commercial applications, including games like *Genshin Impact* and tools like *kcptun*.",
        "commit_count": 253,
        "is_opt_keyword": 7,
        "deepseek_true": 0,
        "deepseek_false": 7,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 0,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "TDengine",
        "http_url": "https://github.com/taosdata/TDengine.git",
        "ssh_url": "git@github.com:taosdata/TDengine.git",
        "summary": "TDengine is an open-source, high-performance, cloud-native time-series database optimized for IoT, Connected Cars, and Industrial IoT applications. It excels in real-time data ingestion, processing, and monitoring, handling TB to PB-scale data daily from billions of sensors. Key features include high performance, simplified data processing, cloud-native architecture, ease of use, and efficient data analytics. Built with technologies like CMake, Go, and Rust, it supports Linux, Windows, and macOS platforms. The repository provides comprehensive documentation, build instructions, and connectors for various programming languages, fostering a vibrant open-source community.",
        "commit_count": 74353,
        "is_opt_keyword": 1317,
        "deepseek_true": 172,
        "deepseek_false": 1145,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 172,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "BlackHole",
        "http_url": "https://github.com/ExistentialAudio/BlackHole.git",
        "ssh_url": "git@github.com:ExistentialAudio/BlackHole.git",
        "summary": "BlackHole is a macOS virtual audio loopback driver designed to enable zero-latency audio routing between applications. It supports customizable channel counts, sample rates, and latency settings, and is compatible with macOS 10.10 and newer, including both Intel and Apple Silicon architectures. Key features include the ability to route audio between applications, record system audio, and create multi-output devices, making it ideal for audio professionals and developers. The repository provides detailed installation, uninstallation, and customization guides, along with user and developer documentation.",
        "commit_count": 626,
        "is_opt_keyword": 7,
        "deepseek_true": 3,
        "deepseek_false": 4,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 3,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ladybird",
        "http_url": "https://github.com/LadybirdBrowser/ladybird.git",
        "ssh_url": "git@github.com:LadybirdBrowser/ladybird.git",
        "summary": "The **Ladybird** repository originally hosted a web browser project but has now been moved into the **SerenityOS monorepo**. The browser is part of the SerenityOS ecosystem, which focuses on building a modern operating system from scratch. The project is now located under the `/Ladybird` directory in the SerenityOS repository, indicating its integration into the broader OS development effort.",
        "commit_count": 66496,
        "is_opt_keyword": 1304,
        "deepseek_true": 381,
        "deepseek_false": 923,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 381,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "Tasmota",
        "http_url": "https://github.com/arendst/Tasmota.git",
        "ssh_url": "git@github.com:arendst/Tasmota.git",
        "summary": "Tasmota is an alternative firmware for ESP8266 and ESP32-based devices, designed for easy configuration, over-the-air (OTA) updates, and local control via MQTT, HTTP, Serial, or KNX. It offers automation through timers or rules and supports a wide range of devices, with a focus on expandability and user-friendly webUI configuration. The firmware is written for PlatformIO and emphasizes safety, especially for devices connected to mains electricity. It includes extensive documentation, community support, and tools for easy installation and customization.",
        "commit_count": 20142,
        "is_opt_keyword": 317,
        "deepseek_true": 20,
        "deepseek_false": 297,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 20,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "jq",
        "http_url": "https://github.com/jqlang/jq.git",
        "ssh_url": "git@github.com:jqlang/jq.git",
        "summary": "The **jq** repository is a lightweight, command-line JSON processor designed for slicing, filtering, mapping, and transforming JSON data, similar to tools like `sed` or `awk`. Written in portable C with zero runtime dependencies, it offers flexibility for handling structured data. Key features include prebuilt binaries, Docker support, and cross-compilation capabilities, with extensive documentation and community resources available. The project is licensed under the MIT License and uses the decNumber library under the ICU License.",
        "commit_count": 1750,
        "is_opt_keyword": 50,
        "deepseek_true": 4,
        "deepseek_false": 46,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 4,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "taichi",
        "http_url": "https://github.com/taichi-dev/taichi.git",
        "ssh_url": "git@github.com:taichi-dev/taichi.git",
        "summary": "The **Taichi** repository is an open-source project for **Taichi Lang**, a high-performance, parallel programming language embedded in Python, designed for numerical computation and real-time simulations. It leverages **JIT compilation** (e.g., LLVM) to optimize Python code for GPU/CPU execution, supporting applications like physical simulation, AI, robotics, and visual effects. Key features include Python-like syntax, cross-platform compatibility (CUDA, Vulkan, etc.), and advanced capabilities like differentiable programming and quantized computation. The repository provides extensive documentation, demos, and community resources for developers.",
        "commit_count": 10861,
        "is_opt_keyword": 408,
        "deepseek_true": 102,
        "deepseek_false": 306,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 102,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ish",
        "http_url": "https://github.com/ish-app/ish.git",
        "ssh_url": "git@github.com:ish-app/ish.git",
        "summary": "The **iSH** repository is a project aimed at running a Linux shell on iOS devices by utilizing usermode x86 emulation and syscall translation. Key features include the ability to execute Linux commands and applications on iOS, with support for building and testing via Xcode or command-line tools like Meson and Ninja. The project uses technologies such as Python, Clang, LLD, and libarchive, and includes a unique interpreter for performance optimization. It also provides extensive logging options and a self-contained Alpine Linux filesystem for testing. The project is available on the App Store and has a TestFlight beta for iOS users.",
        "commit_count": 4141,
        "is_opt_keyword": 68,
        "deepseek_true": 4,
        "deepseek_false": 64,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 4,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "swift",
        "http_url": "https://github.com/apple/swift.git",
        "ssh_url": "git@github.com:apple/swift.git",
        "summary": "The **Swift** repository is the official source code for the Swift programming language, developed by Apple. It is a high-performance, memory-safe system programming language with a modern syntax, designed for seamless interoperability with C and Objective-C. The repository supports cross-platform development, including macOS, Linux, and Windows, and provides tools for building and testing Swift toolchains. It encourages community contributions and emphasizes a welcoming, diverse developer community.",
        "commit_count": 178359,
        "is_opt_keyword": 6400,
        "deepseek_true": 1275,
        "deepseek_false": 5125,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 1275,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "curl",
        "http_url": "https://github.com/curl/curl.git",
        "ssh_url": "git@github.com:curl/curl.git",
        "summary": "The **curl** repository is the source code for the widely-used command-line tool and library for transferring data using URLs. It supports a variety of protocols (e.g., HTTP, FTP) and is distributed under an MIT-like license. The repository includes the **libcurl** library, which allows developers to integrate its functionality into their own software. The project is open source, encourages community contributions, and offers commercial support options.",
        "commit_count": 33989,
        "is_opt_keyword": 619,
        "deepseek_true": 104,
        "deepseek_false": 515,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 104,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "bitcoin",
        "http_url": "https://github.com/bitcoin/bitcoin.git",
        "ssh_url": "git@github.com:bitcoin/bitcoin.git",
        "summary": "The **bitcoin** repository hosts the source code for **Bitcoin Core**, the reference implementation of the Bitcoin protocol. It enables users to connect to the Bitcoin peer-to-peer network, validate blocks and transactions, and includes a wallet and optional graphical user interface. The project is built using C++ and follows a rigorous development process with automated testing, continuous integration, and a focus on security. Contributions are managed through a detailed workflow, and translations are handled via Transifex. The software is released under the MIT license.",
        "commit_count": 43490,
        "is_opt_keyword": 1892,
        "deepseek_true": 374,
        "deepseek_false": 1518,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 374,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "ImHex",
        "http_url": "https://github.com/WerWolv/ImHex.git",
        "ssh_url": "git@github.com:WerWolv/ImHex.git",
        "summary": "ImHex is a feature-rich, open-source hex editor designed for reverse engineers, programmers, and anyone working with binary data. It offers advanced functionalities such as a custom C++-like pattern language for parsing and highlighting file content, a node-based data pre-processor, integrated disassembler, YARA rule support, and extensive data analysis tools. Built with modern technologies like Dear ImGui for the interface and supporting multiple platforms (Windows, macOS, Linux), ImHex also includes features like theming, plugin support, and a web version. It is licensed under GPLv2, with some components under LGPLv2.1 to allow proprietary plugin development.",
        "commit_count": 4819,
        "is_opt_keyword": 198,
        "deepseek_true": 24,
        "deepseek_false": 174,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 24,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "sway",
        "http_url": "https://github.com/swaywm/sway.git",
        "ssh_url": "git@github.com:swaywm/sway.git",
        "summary": "The **sway** repository is a Wayland compositor designed to be compatible with the i3 window manager, offering a tiling window management experience. It supports a wide range of languages and can be installed via package managers or compiled from source using dependencies like `wlroots`, `meson`, and `wayland`. Sway is highly configurable, allowing users to reuse their i3 configurations, and is typically run from a TTY, though some display managers like GDM are also supported.",
        "commit_count": 7476,
        "is_opt_keyword": 104,
        "deepseek_true": 5,
        "deepseek_false": 99,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 5,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "imgui",
        "http_url": "https://github.com/ocornut/imgui.git",
        "ssh_url": "git@github.com:ocornut/imgui.git",
        "summary": "The **Dear ImGui** repository is a lightweight, fast, and portable **immediate mode GUI library for C++**, designed for creating tools, debug interfaces, and visualization applications. It is particularly suited for game engines, real-time 3D applications, and embedded systems. Key features include minimal state synchronization, ease of integration with various rendering backends (e.g., DirectX, OpenGL, Vulkan), and support for dynamic, code-driven UIs. The library is widely used in the game industry and offers extensive customization, though it lacks high-level features like internationalization and accessibility. It is open-source under the MIT license and relies on community support for ongoing development.",
        "commit_count": 8551,
        "is_opt_keyword": 80,
        "deepseek_true": 8,
        "deepseek_false": 72,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 8,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "sumatrapdf",
        "http_url": "https://github.com/sumatrapdfreader/sumatrapdf.git",
        "ssh_url": "git@github.com:sumatrapdfreader/sumatrapdf.git",
        "summary": "The **SumatraPDF** repository hosts a lightweight, open-source multi-format document reader for Windows, supporting formats like PDF, EPUB, MOBI, CBZ, and more. It is licensed under (A)GPLv3, with some components under BSD. The project emphasizes simplicity and efficiency, offering a manual and developer documentation for contributors. Continuous integration is managed via GitHub Actions.",
        "commit_count": 15880,
        "is_opt_keyword": 217,
        "deepseek_true": 47,
        "deepseek_false": 170,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 47,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "hyperscan",
        "http_url": "https://github.com/intel/hyperscan.git",
        "ssh_url": "git@github.com:intel/hyperscan.git",
        "summary": "Hyperscan is a high-performance regex matching library designed for simultaneous matching of large numbers of regular expressions across data streams, commonly used in Deep Packet Inspection (DPI) stacks. It supports a C API and follows the syntax of the libpcre library, utilizing hybrid automata techniques for efficient pattern matching. The library is licensed under BSD, with stable releases on the `master` branch and ongoing development on the `develop` branch. Documentation and community involvement are supported through a developer reference guide, mailing list, and direct contact with the Intel team.",
        "commit_count": 1316,
        "is_opt_keyword": 40,
        "deepseek_true": 15,
        "deepseek_false": 25,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 15,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "srs",
        "http_url": "https://github.com/ossrs/srs.git",
        "ssh_url": "git@github.com:ossrs/srs.git",
        "summary": "The **SRS (Simple Realtime Server)** repository is a high-efficiency, open-source video server designed for real-time streaming. It supports multiple protocols like RTMP, WebRTC, HLS, HTTP-FLV, SRT, and MPEG-DASH, and is compatible with various platforms (Linux, Windows, macOS) and architectures (x86, ARM, etc.). Key features include low-latency streaming, clustering, and transcoding, making it suitable for building scalable live streaming and RTC platforms. The project is MIT-licensed, actively maintained, and includes Docker support for easy deployment.",
        "commit_count": 8689,
        "is_opt_keyword": 141,
        "deepseek_true": 43,
        "deepseek_false": 98,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 43,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "HandBrake",
        "http_url": "https://github.com/HandBrake/HandBrake.git",
        "ssh_url": "git@github.com:HandBrake/HandBrake.git",
        "summary": "HandBrake is an open-source video transcoder designed for Linux, macOS, and Windows, licensed under the GNU General Public License (GPL) Version 2. It converts videos into formats compatible with a wide range of devices, including mobile phones, tablets, TVs, and game consoles, using tools like FFmpeg, x264, and x265. The repository supports community contributions, translations via Transifex, and provides comprehensive documentation and forums for user support.",
        "commit_count": 12820,
        "is_opt_keyword": 585,
        "deepseek_true": 67,
        "deepseek_false": 518,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 67,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "spdlog",
        "http_url": "https://github.com/gabime/spdlog.git",
        "ssh_url": "git@github.com:gabime/spdlog.git",
        "summary": "The **spdlog** repository is a fast, header-only C++ logging library designed for high performance and flexibility. It supports various log targets (e.g., files, console, syslog) and features like asynchronous logging, custom formatting, and multi-threaded loggers. Built with C++11 and leveraging the **fmt** library for formatting, it is cross-platform (Linux, Windows, macOS, etc.) and available via multiple package managers. Its key strengths include speed, extensibility, and rich functionality, making it a popular choice for C++ developers.",
        "commit_count": 4390,
        "is_opt_keyword": 95,
        "deepseek_true": 14,
        "deepseek_false": 81,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 14,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "gpt4all",
        "http_url": "https://github.com/nomic-ai/gpt4all.git",
        "ssh_url": "git@github.com:nomic-ai/gpt4all.git",
        "summary": "The **GPT4All** repository enables users to run large language models (LLMs) privately on everyday desktops and laptops without requiring GPUs or API calls. It provides a desktop application and Python bindings for local LLM inference, leveraging technologies like `llama.cpp` for efficiency. Key features include support for various model architectures, integrations with tools like Langchain and Weaviate, and features like LocalDocs for private data interaction. The project is open-source, supports multiple platforms, and emphasizes accessibility and privacy.",
        "commit_count": 2203,
        "is_opt_keyword": 41,
        "deepseek_true": 2,
        "deepseek_false": 39,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 2,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "serenity",
        "http_url": "https://github.com/SerenityOS/serenity.git",
        "ssh_url": "git@github.com:SerenityOS/serenity.git",
        "summary": "SerenityOS is a modern, graphical Unix-like operating system designed for 64-bit x86, Arm, and RISC-V architectures, inspired by the aesthetics of 1990s productivity software and the functionality of Unix systems. It features a custom-built kernel, a browser with JavaScript and WebAssembly support, a suite of system services, and a variety of applications including games, utilities, and development tools. The project is entirely self-contained, with no external dependencies, and supports cross-compilation from Linux, macOS, and Windows. It is developed by a large community of contributors and is licensed under a 2-clause BSD license.",
        "commit_count": 64517,
        "is_opt_keyword": 1269,
        "deepseek_true": 374,
        "deepseek_false": 895,
        "deepseek_unknown": 0,
        "is_system_software": "true",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 374,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "grpc",
        "http_url": "https://github.com/grpc/grpc.git",
        "ssh_url": "git@github.com:grpc/grpc.git",
        "summary": "The **gRPC** repository is a modern, open-source, high-performance Remote Procedure Call (RPC) framework designed to facilitate seamless communication between client and server applications across various environments. It supports multiple programming languages, including C++, Java, Python, Go, and more, with language-specific runtime packages available through standard package managers. Built on a shared C++ core library, gRPC simplifies the development of connected systems and provides daily precompiled builds, extensive documentation, and performance monitoring. Contributions are encouraged, with detailed guidelines provided for developers.",
        "commit_count": 55963,
        "is_opt_keyword": 1066,
        "deepseek_true": 116,
        "deepseek_false": 950,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 116,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "solidity",
        "http_url": "https://github.com/ethereum/solidity.git",
        "ssh_url": "git@github.com:ethereum/solidity.git",
        "summary": "The **Solidity** repository is the official source for the Solidity programming language, a statically-typed, contract-oriented language designed for writing smart contracts on the Ethereum blockchain. It provides tools and resources for developing, deploying, and testing smart contracts, with features like a compiler, documentation, and example contracts. The project is actively maintained by the Ethereum Foundation, uses a fast-paced development cycle, and is licensed under the GNU General Public License v3.0. Developers can contribute to its ongoing development, and resources like Remix IDE and the Solidity Language Portal are available for learning and experimentation.",
        "commit_count": 25077,
        "is_opt_keyword": 724,
        "deepseek_true": 73,
        "deepseek_false": 651,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 73,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "googletest",
        "http_url": "https://github.com/google/googletest.git",
        "ssh_url": "git@github.com:google/googletest.git",
        "summary": "The **googletest** repository is Google's C++ test framework, combining GoogleTest and GoogleMock into a single project for unit testing. It provides a robust xUnit-based framework with features like automatic test discovery, rich assertion capabilities, death tests, and support for value- and type-parameterized tests. Built for modern C++ (C++14 and above), it is widely used in projects like Chromium, LLVM, and OpenCV, and integrates with tools like VS Code extensions and parallel test runners. The project follows Google's \"Live at Head\" philosophy, encouraging frequent updates to the latest commit.",
        "commit_count": 4452,
        "is_opt_keyword": 81,
        "deepseek_true": 8,
        "deepseek_false": 73,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 8,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    },
    {
        "name": "goaccess",
        "http_url": "https://github.com/allinurl/goaccess.git",
        "ssh_url": "git@github.com:allinurl/goaccess.git",
        "summary": "GoAccess is an open-source, real-time web log analyzer and interactive viewer designed for system administrators. It provides fast and detailed HTTP statistics by parsing web log files and displaying the data in a terminal or browser. Key features include real-time updates, support for nearly all web log formats (e.g., Apache, Nginx, AWS), incremental log processing, and minimal configuration requirements. Built in C with only ncurses as a dependency, GoAccess also offers Docker support, customizable outputs (HTML, JSON, CSV), and advanced filtering capabilities for analyzing large datasets.",
        "commit_count": 4242,
        "is_opt_keyword": 35,
        "deepseek_true": 5,
        "deepseek_false": 30,
        "deepseek_unknown": 0,
        "is_system_software": "false",
        "missing_is_code_optimization": 0,
        "not_in_one_func": 0,
        "unaccounted": 0,
        "is_opt_final": 5,
        "one_file": 0,
        "c_language": 0,
        "final_benchmark": 0,
        "final_benchmark_with_func": 0,
        "one_func": 0
    }
]